Revit.Elements.FillPatternElement
Fill Pattern Element

Revit.Elements.FillPatternElement.InternalRevitElement
Internal reference to the Revit Element

Revit.Elements.FillPatternElement.InternalElement
Reference to the Element

Revit.Elements.FillPatternElement.InternalSetElement(Autodesk.Revit.DB.FillPatternElement)
Set the internal Element, ElementId, and UniqueId
e:

Revit.Elements.FillPatternElement.#ctor(Autodesk.Revit.DB.FillPatternElement)
FillPatternElement from existing
e:

Revit.Elements.FillPatternElement.InitElement(Autodesk.Revit.DB.FillPatternElement)
Init FillPatternElement from existing
e:

Revit.Elements.FillPatternElement.GetByName(System.String,System.String)
Fill Pattern Element by Name and Target Type.
name: Name of the Fill Pattern.
fillPatternTarget: Target Fill pattern. Fill Patterns can be either "Drafting" or "Modeling". Default is "Drafting".
Filled Pattern Element.

Revit.Elements.FillPatternElement.FromExisting(Autodesk.Revit.DB.FillPatternElement,System.Boolean)
From existing element
instance:
isRevitOwned:
Returns: